Autodesk.Revit.DB.MaterialFunctionAssignment.StructuralDeck
Default priority = 1. Indicates layer is a structural deck.

Autodesk.Revit.DB.MaterialFunctionAssignment.Finish2
Default priority = 5 (The lowest effective priority)

Autodesk.Revit.DB.MaterialFunctionAssignment.Finish1
Default priority = 4

Autodesk.Revit.DB.MaterialFunctionAssignment.Insulation
Default priority = 3

Autodesk.Revit.DB.MaterialFunctionAssignment.Substrate
Default priority = 2

Autodesk.Revit.DB.MaterialFunctionAssignment.Structure
Default priority = 1 (The highest effective priority)

Autodesk.Revit.DB.MaterialFunctionAssignment.None
Default priority = 0 This is deprecated and should not be used.